'''
Підказки, які з`являють на нижній панелі у "навчальному" режимі 
Не відтворюються під час виконання програми, якщо панель невидима або якщо вікно програми занадто мале
'''

import wx
import random

tips=["Хочете навчитись програмувати - почніть з вивчення базового синтаксису Python",
"Комп'ютерна програма - набір вказівок, записаних у спосіб, зрозумілий для їх виконання комп'ютером.",
"Мова програмування - це інструкції для запису комп'ютерних програм та правила їх застосування.",
"Використовуйте 'print()' для виведення тексту, чисел та значень змінних на екран.",
"Рядкові значення в Python обмежуються одинарними або подвійними лапками",
"Використовуйте прості та інтуїтивно зрозумілі імена для створюваних змінних",
"Функція 'input()' дозволить отримати рядок даних від користувача",
"Використовуйте 'if', 'else' для прийняття рішень щодо подальших дій у програмі",
"Порівнюйте значення за допомогою операторів '>', '<', '==', '!=' ",
"Використовуйте 'and', 'or', 'not' для поєднання різних логічних умов",
"Використовуйте 'len()' для визначення довжини рядка та кількості елементів списку.",
"Використовуйте вказівку 'for' для повторення дій",
"Використовуйте 'while' для циклів, в яких виконання дій відбувається за умовою",
"Створюйте власні функції за допомогою вказівки 'def'.",
"Аргументи функції записують у дужках після імені при її створення.",
"Блоки коду у Python виділяються відступами",
"Не змішуйте у відступах символи пропуску(Space) і табуляції(Tab)",
"Використовуйте 'return' для повернення результату з функції",
"Словники дозволяють зберігати дані у вигляді пар 'ключ-значення'",
"Використовуйте 'import' для підключення додаткових модулів з бібліотек",
"Імпортуйте модуль 'random' для генерації випадкових чисел",
"Використовуйте 'range()' для створення послідовностей чисел",
"Використовуйте 'try' та 'except' для обробки помилок.",
"Скориставшись tkinter, можна створювати програми з графічним інтерфейсом",
"Навчайтесь програмувати, створюючи прості ігри, наприклад, 'Вгадай число'",
"Використовуйте коментарі, які починаються з символу '#' для пояснення коду",
"Щоб негайно вийти з циклу, скористайтесь вказівкою 'break'",
"Якщо потрібно пропустити поточну ітерацію цикли - використайте 'continue'",
"Скористайтесь вказівкою 'pass', якщо потрібно залишити блок коду порожнім",
"Використовуйте 'format()' або 'f-strings' для форматування рядків перед їх виведенням",
"Спробуйте створювати прості калькулятори для додавання, віднімання, множення, ділення чисел",
"Використовуйте 'upper()' та 'lower()' для зміни регістру символів у рядкових значеннях",
"Навчіться працювати зі зрізами (slicing) у списках та рядках",
"Використовуйте 'append()' для додавання елементів до списку.",
"Навчіться видаляти елементи зі списку за допомогою 'remove()'",
"Використовуйте 'sort()' для сортування списку",
"Використовуйте 'keys()', 'values()', 'items()' для роботи зі словниками",
"Використовуйте 'time.sleep()' для паузи у програмі",
"Навчіться працювати з модулем 'math' для математичних операцій",
"Потрібно з дробового числа отримати ціле? - використайте 'round()' для округлення чисел.",
"Навчіться працювати з модулем 'datetime' для роботи з датами",
"Створювати прості графіки можна за допомогою 'matplotlib'.",
"Використовуйте 'pip' для встановлення додаткових бібліотек",
"Навчіться працювати з 'lambda' для створення коротких функцій",
"Насолоджуйтеся процесом навчання та експериментуйте з кодом! ",
"Красиве краще, ніж потворне - код повинен бути читабельним і естетично приємним.",
"Явне краще, ніж неявне - код має бути зрозумілим, уникайте прихованих дій.",
"Просте краще, ніж складне - намагайтеся писати простий код, уникаючи зайвої складності.",
"Складне краще, ніж заплутане - якщо складність необхідна, вона має бути організованою, а не хаотичною.",
"Пласке краще, ніж вкладене - уникайте надмірного вкладення коду, це ускладнює читання.",
"Розріджене краще, ніж щільне - код має бути розбитий на логічні блоки, а не стиснутий в один довгий рядок.",
"Читабельність має значення - код повинен бути зрозумілим для інших людей.",
"Особливі випадки не настільки особливі, щоб порушувати правила.",
"Часто практичність важливіша за бездоганність - іноді краще зробити практично, ніж ідеально.",
"Помилки ніколи не повинні замовчуватися - обробляйте помилки явно, щоб уникнути несподіваних проблем.",
"Іноді можна ігнорувати помилки, але лише якщо це зроблено навмисно і вони не впливають на роботу програми.",
"Зустрічаючи двозначність, відкидай спокусу вгадати - уникайте неясностей, пишіть код, який не викликає сумнівів.",
"Має бути один — і, бажано, лише один — очевидний спосіб зробити щось.",
"Зараз краще, ніж ніколи - не відкладайте написання коду на потім.",
"У деяких випадках 'ніколи' часто краще, ніж 'саме зараз' - іноді краще повністю відмовитися від ідеї, ніж реалізувати її негайно.",
"Якщо реалізацію важко пояснити, це погана ідея - код має бути простим і зрозумілим для пояснення.",
"Якщо реалізацію легко пояснити, це, можливо, хороша ідея, адже простота — це ключ до гарного коду.",
"Щоб крокувати до мети, ставте перед собою реальні цілі - не намагайтеся вивчити все і відразу.",
"Зважайте на те, що програмування – це світ, у якому завжди буде щось нове.",
"Складні завдання розділяйте на маленькі кроки і рухайтесь до виконання поступово.",
"Робіть перерви - не можна сидіти годинами за комп'ютером без відпочинку, адже ви людина, а не машина.",
"Не бійтесь помилок, адже кожна помилка – це можливість чогось навчитися, розберіться, що пішло не так, і зрозумійте, як цього уникнути у майбутньому.",
"Навчіться запитувати - більш досвідчені товариші та викладачі  допоможуть підказати, що у вас виходить не так, і як це виправити.",
"Фізична активність та здорове харчування допомагають зберігати енергію та концентрацію - це важливо, коли багато сидиш за комп'ютером.",
"Не забувайте про світ навколо вас - знаходьте час для захоплень, спорту, спілкування з сім'єю та друзями.",
"Програмування – це довгий шлях, радійте маленьким перемогам і відзначайте свої успіхи, адже це допоможе зберегти мотивацію та продовжити вчитися.",
"Вивчайте нові інструменти та технології - це може зробити вашу діяльність простішою та цікавішою."
]
tips_count = len(tips)-1
used_tips =[]
tips_delay = 7000
class DrTips():
    def __init__(self,parent,msgbox):
        self.parent = parent
        self.msg = msgbox
        self.msg.SetLabel("Вітаємо у DrPython - найкращому середовищі для тих, хто прагне вивчити програмування")
        self.msg.Wrap(350)
        self.timer = wx.Timer(parent)  # Створюємо таймер
        parent.Bind(wx.EVT_TIMER, self.new_msg, self.timer)  # Прив'язуємо подію таймера

        # Запускаємо таймер
        self.timer.Start(tips_delay)
    
    def new_msg(self, event):
        # Ця функція викликається по таймеру
        if self.parent.run_state:
            return
        if not self.parent.tool_panel.IsShown():
            return
        w,h = self.parent.GetSize()
        if self.parent.openBtn.IsShown():
            wx = w - 450
        else:
            wx = w - 150
        if wx < 350:
            return    

        new_choice = random.randint(0,tips_count)
        if len(used_tips) == tips_count:
            used_tips.clear()
        while new_choice in used_tips:
            new_choice = random.randint(0,tips_count)
        used_tips.append(new_choice)
        self.msg.SetLabel(tips[new_choice])
        self.msg.Wrap(wx)
